import top.mrxiaom.overflow.internal.utils.securityLength
import java.util.Random
import java.util.UUID
import kotlin.math.pow
import kotlin.test.Test

/**
 * ================================================
 * Author:     886kagg
 * Created on: 2025/9/6 20:38
 * ================================================
 */

private const val TEST_COUNT = 1e6.toInt()

class SecurityTest {


    /**
     *
     * 该benchmark计算了密码长度和内含字符种类对安全性的量化影响，表格如下：
     *
     *
     * | 密码长度 | 纯数字 | 纯小写 | 数字+小写 | 数字+小写+大写 | 数字+小写+大写+特殊字符 |
     * |---------|--------|--------|-----------|----------------|----------------------|
     * | 3       | *1.713*  | *2.407*  | *2.362*     | *2.811*          | -                    |
     * | 4       | *1.946*  | *2.699*  | *2.861*     | *3.270*          | 3.596                |
     * | 5       | *2.124*  | *2.919*  | *3.173*     | 3.552          | 3.960                |
     * | 6       | *2.265*  | *3.092*  | *3.428*     | 3.818          | 4.222                |
     * | 7       | *2.379*  | *3.235*  | 3.640     | 4.047          | 4.427                |
     * | 8       | *2.474*  | *3.356*  | 3.807     | 4.224          | 4.528                |
     * | 9       | *2.552*  | *3.459*  | 3.969     | 4.357          | **4.734**            |
     * | 10      | *2.620*  | 3.549  | 4.088     | **4.514**      | **4.901**            |
     * | 11      | *2.678*  | 3.629  | 4.218     | **4.643**      | **5.040**            |
     * | 12      | *2.728*  | 3.699  | 4.308     | **4.724**      | **5.056**            |
     * | 13      | *2.772*  | 3.763  | 4.416     | **4.841**      | **5.198**            |
     * | 14      | *2.810*  | 3.820  | 4.487     | **4.941**      | **5.319**            |
     * | 15      | *2.844*  | 3.872  | **4.579** | **4.995**      | **5.423**            |
     * | 16      | -      | -      | -         | -              | **5.414**            |
     *
     * 我们可以认为4.5(加粗)以上的密码是极度安全的，而3.5(加斜)以下的密码是极度不安全的
     */
    @Test
    fun testSecurity() {
        for (i in 3..15) {
            println("$i 数量级密码强度："+(1..TEST_COUNT).sumOf { (10.0.pow(i.toDouble()).toLong() until 10.0.pow((i + 1.toDouble())).toLong()).random().toString().securityLength() } / TEST_COUNT)
        }

        for (i in 3..15) {
            println("$i 位纯小写字符串密码强度：" + (1..TEST_COUNT).sumOf { (1..i).joinToString { ('a'..'z').random().toString() }.securityLength() } / TEST_COUNT)
        }


        val seq1 = (0..9).toList()
        val seq2 = ('a'..'z').toList()


        fun <T:Any> List<T>.seq(num: Int) = if(num > 0) (1..num).joinToString { random().toString() } else error("Invalid seq length")

        for (i in 3..15) {
            println("$i 位数字+小写串密码强度：" + (1..TEST_COUNT).sumOf { (seq1.seq(i/2) + seq2.seq(i - i/2)).securityLength() } / TEST_COUNT)
        }

        val seq3 = ('A'..'Z').toList()

        for (i in 3..15) {
            println("$i 位数字+小写+大写串密码强度：" + (1..TEST_COUNT).sumOf { (seq1.seq(i/3) + seq2.seq(i - i/3) + seq3.seq(i - i/3 - i/3)).securityLength() } / TEST_COUNT)
        }

        val seq4 = """~!@#$%^&*()_+`-={}|[]\<>?,./:;'\"""".toList()

        for (i in 4..16) {
            println("$i 位数字+小写+大写+特殊字符串密码强度：" + (1..TEST_COUNT).sumOf { (seq1.seq(i/4) + seq2.seq(i - i/4) + seq3.seq(i - i/4 - i/4) + seq4.seq(i - i/4 - i/4 - i/4)).securityLength() } / TEST_COUNT)
        }


        //3 数量级密码强度：1.7126038606007825
        //4 数量级密码强度：1.9463365895805829
        //5 数量级密码强度：2.1237284038148956
        //6 数量级密码强度：2.264935824456068
        //7 数量级密码强度：2.3791053909367164
        //8 数量级密码强度：2.4737907261360754
        //9 数量级密码强度：2.5524121256095995
        //10 数量级密码强度：2.619811280543177
        //11 数量级密码强度：2.6777837555926722
        //12 数量级密码强度：2.7278836027822866
        //13 数量级密码强度：2.771529366764869
        //14 数量级密码强度：2.81008167647712
        //15 数量级密码强度：2.843796357358695
        //3 位纯小写字符串密码强度：2.4068762579405445
        //4 位纯小写字符串密码强度：2.699302457889968
        //5 位纯小写字符串密码强度：2.918664688132133
        //6 位纯小写字符串密码强度：3.092319071912508
        //7 位纯小写字符串密码强度：3.234979023615928
        //8 位纯小写字符串密码强度：3.355699138911968
        //9 位纯小写字符串密码强度：3.4588306490469956
        //10 位纯小写字符串密码强度：3.549190987308037
        //11 位纯小写字符串密码强度：3.628507812332596
        //12 位纯小写字符串密码强度：3.6992828578261663
        //13 位纯小写字符串密码强度：3.762817695592251
        //14 位纯小写字符串密码强度：3.820145156974343
        //15 位纯小写字符串密码强度：3.8721526265720305
        //3 位数字+小写串密码强度：2.362231556026885
        //4 位数字+小写串密码强度：2.8610603338747023
        //5 位数字+小写串密码强度：3.1732271934441583
        //6 位数字+小写串密码强度：3.4275812827506624
        //7 位数字+小写串密码强度：3.639703277773757
        //8 位数字+小写串密码强度：3.8067829470391605
        //9 位数字+小写串密码强度：3.9685992695028776
        //10 位数字+小写串密码强度：4.088026299405232
        //11 位数字+小写串密码强度：4.217758049417375
        //12 位数字+小写串密码强度：4.308120105482776
        //13 位数字+小写串密码强度：4.415780022305269
        //14 位数字+小写串密码强度：4.486730594732781
        //15 位数字+小写串密码强度：4.578640761034155
        //3 位数字+小写+大写串密码强度：2.8105889099176804
        //4 位数字+小写+大写串密码强度：3.2700193839942657
        //5 位数字+小写+大写串密码强度：3.551579975776902
        //6 位数字+小写+大写串密码强度：3.817819592417094
        //7 位数字+小写+大写串密码强度：4.04713627382804
        //8 位数字+小写+大写串密码强度：4.2244898036649445
        //9 位数字+小写+大写串密码强度：4.357435311211382
        //10 位数字+小写+大写串密码强度：4.51381931577037
        //11 位数字+小写+大写串密码强度：4.642831524571296
        //12 位数字+小写+大写串密码强度：4.723797485355657
        //13 位数字+小写+大写串密码强度：4.840910331999615
        //14 位数字+小写+大写串密码强度：4.940689120986165
        //15 位数字+小写+大写串密码强度：4.994636889368399
        //4 位数字+小写+大写+特殊字符串密码强度：3.5960294554059273
        //5 位数字+小写+大写+特殊字符串密码强度：3.959876372734165
        //6 位数字+小写+大写+特殊字符串密码强度：4.221738185882626
        //7 位数字+小写+大写+特殊字符串密码强度：4.426951944325148
        //8 位数字+小写+大写+特殊字符串密码强度：4.527540568009599
        //9 位数字+小写+大写+特殊字符串密码强度：4.733723163068755
        //10 位数字+小写+大写+特殊字符串密码强度：4.9006659429245865
        //11 位数字+小写+大写+特殊字符串密码强度：5.040231251094223
        //12 位数字+小写+大写+特殊字符串密码强度：5.056428477721233
        //13 位数字+小写+大写+特殊字符串密码强度：5.197888470813864
        //14 位数字+小写+大写+特殊字符串密码强度：5.3186820442776614
        //15 位数字+小写+大写+特殊字符串密码强度：5.4231006462150235
        //16 位数字+小写+大写+特殊字符串密码强度：5.41374579296965

    }
}
